# AnalysisZoneBottomOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RouteAnalysisSettings..::..AnalysisZoneBottomOffset Property
RouteAnalysisSettings Class See Also
---
The bottom plane offset, in ft, of the zone used in route calculation. Default value is 8".
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public double AnalysisZoneBottomOffset { get; set; }
```

Visual Basic
---
```text
Public Property AnalysisZoneBottomOffset As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double AnalysisZoneBottomOffset {
	double get ();
	void set (double value);
}
```

# Remarks
The zone's bottom plane elevation is different per plan view and is determined by adding the bottom offset to the view's level elevation.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for bottomOffset must be non-negative. |

# See Also
RouteAnalysisSettings Class
Autodesk.Revit.DB.Analysis Namespace